1. Вибрати імена пасажирів, які підпадають під такі критерії:
    - Клас каюти 1-й чи 3-й,
    - Вік в інтервалі від 20 до 40,
    - Ціна квитка НЕ знаходиться в інтервалі від 70 до 100.

In [58]:
import pandas as pd

titanic_data = pd.read_csv('Заняття5/Files/TitanicDataset.csv', sep=',', header=0)

In [59]:
titanic_data['Name'][(titanic_data['Pclass'].isin([1,3])) &
             (titanic_data['Age'] >= 20) & (titanic_data['Age'] <= 40) &
             ((titanic_data['Fare'] < 70) | (titanic_data['Fare'] > 100))].head()

0                              Braund, Mr. Owen Harris
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Name: Name, dtype: object

2. Ми отримали словник таблиць при читанні з файлу Excel - `crime_data`. Необхідно об'єднати всі таблиці словника в один DataFrame.

In [60]:
crime_data = pd.read_excel(
    'Заняття5/Files/CrimesData.xlsx',
    sheet_name=None, 
    usecols="A:F",
    nrows=5
)

In [61]:
crime_date_df = pd.concat(crime_data)
# crime_date_df = pd.concat(crime_data.values())
crime_date_df.head(10)

         CrimeDate CrimeTime CrimeCode           Location Description Weapon
2011 0  01/01/2011  00:00:00        6G       0 E CROSS ST           I    NaN
     1  01/01/2011  00:10:00        5D  1900 W LOMBARD ST           I    NaN
     2  01/01/2011  01:00:00        5D  2900 WATERVIEW AV           O    NaN
     3  01/01/2011  01:38:00        4B      1500 HAZEL ST           O  KNIFE
     4  01/01/2011  02:01:00        4B      0 W WILKES LN           O  KNIFE
2012 0  01/01/2012  00:00:00        5C                NaN           I    NaN
     1  01/01/2012  01:00:00        6C       0 E NORTH AV           I    NaN
     2  01/01/2012  01:01:00        5A    1800 LETITIA AV           I    NaN
     3  01/01/2012  01:01:00        6E   2100 AISQUITH ST           O    NaN
     4  01/01/2012  01:10:00        4B    2200 EASTERN AV           O  KNIFE

3. Знайти унікальні комбінації значень колонок `Survived/Pclass/Sex` для пасажирів, у яких не відомий вік.

In [57]:
titanic_data[['Sex', 'Survived', 'Pclass']][titanic_data['Age'].isna()].drop_duplicates()

        Sex  Survived  Pclass
5      male         0       3
17     male         1       2
19   female         1       3
31   female         1       1
36     male         1       3
55     male         1       1
64     male         0       1
140  female         0       3
181    male         0       2
303  female         1       2